testing/serverless-artillery/serverless-artillery-users-id.yml
#Artillery test for /users/{user_id}/tasks- 10 concurrent requests per second for 5 mins

config:
  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net/api/users/1"
  phases:
    - duration: 300
      arrivalRate: 10
      name: "users"
scenarios:
  - flow:
      - get:
          url: "/api/HttpTriggerLoadTest/"
          json:
          afterResponse: "logResponse"